In [1]:
import pandas as pd

In [20]:
chicago = pd.read_csv("chicago.csv").dropna(how="all")
chicago.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [21]:
chicago.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32062 entries, 0 to 32061
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Name                    32062 non-null  object
 1   Position Title          32062 non-null  object
 2   Department              32062 non-null  object
 3   Employee Annual Salary  32062 non-null  object
dtypes: object(4)
memory usage: 1.2+ MB

In [13]:
chicago["Position Title"].value_counts()

POLICE OFFICER                            9184
FIREFIGHTER-EMT                           1208
SERGEANT                                  1185
POOL MOTOR TRUCK DRIVER                    918
POLICE OFFICER (ASSIGNED AS DETECTIVE)     896
                                          ...
READER                                       1
DIR OF SPECIAL EVENTS                        1
SANITARY ENGINEER IV                         1
FIRST DEPUTY PROCUREMENT OFFICER             1
MECHANICAL ENGINEER IV                       1
Name: Position Title, Length: 1093, dtype: int64

In [22]:
chicago.nunique()

Name                      31776
Position Title             1093
Department                   35
Employee Annual Salary     1156
dtype: int64

In [24]:
chicago["Department"] = chicago["Department"].astype("category")

In [25]:
chicago.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32062 entries, 0 to 32061
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Name                    32062 non-null  object
 1   Position Title          32062 non-null  object
 2   Department              32062 non-null  category
 3   Employee Annual Salary  32062 non-null  object
dtypes: category(1), object(3)
memory usage: 1.0+ MB

In [26]:
chicago["Department"].value_counts()

POLICE                   12618
FIRE                      4796
STREETS & SAN             2152
OEMC                      1982
WATER MGMNT               1840
AVIATION                  1521
TRANSPORTN                1073
PUBLIC LIBRARY             961
GENERAL SERVICES           930
FAMILY & SUPPORT           654
FINANCE                    577
HEALTH                     529
LAW                        414
CITY COUNCIL               396
BUILDINGS                  262
COMMUNITY DEVELOPMENT      208
BUSINESS AFFAIRS           161
BOARD OF ELECTION          117
DoIT                       102
CITY CLERK                  94
MAYOR'S OFFICE              86
PROCUREMENT                 83
IPRA                        82
CULTURAL AFFAIRS            74
HUMAN RESOURCES             70
ANIMAL CONTRL               67
INSPECTOR GEN               57
BUDGET & MGMT               39
ADMIN HEARNG                39
DISABILITIES                28
TREASURER                   22
HUMAN RELATIONS             16
BOARD OF ETHICS              9
POLICE BOARD                 2
LICENSE APPL COMM            1
Name: Department, dtype: int64

In [30]:
"boris".upper()
"boris".lower()
"boris is a genuis".title()

'Boris Is A Genuis'

In [33]:
chicago["Position Title"] = chicago["Position Title"].str.title()

In [35]:
chicago["Position Title"].str.len()

0        16
1        14
2        14
3        24
4        17
         ..
32057    30
32058    14
32059    14
32060    14
32061    23
Name: Position Title, Length: 32062, dtype: int64

In [37]:
chicago["Position Title"].str.title().str.len()

0        16
1        14
2        14
3        24
4        17
         ..
32057    30
32058    14
32059    14
32060    14
32061    23
Name: Position Title, Length: 32062, dtype: int64

In [38]:
chicago["Position Title"].str.strip() #beginning and end spaces or L strip or R strip

0                      Water Rate Taker
1                        Police Officer
2                        Police Officer
3              Chief Contract Expediter
4                     Civil Engineer Iv
                      ...
32057    Frm Of Machinists - Automotive
32058                    Police Officer
32059                    Police Officer
32060                    Police Officer
32061           Chief Data Base Analyst
Name: Position Title, Length: 32062, dtype: object

In [45]:
chicago["Department"] = chicago["Department"].str.replace("MGMNT", "MANAGEMENT")

In [46]:
chicago.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",Water Rate Taker,WATER MANAGEMENT,$90744.00
1,"AARON, JEFFERY M",Police Officer,POLICE,$84450.00
2,"AARON, KARINA",Police Officer,POLICE,$84450.00
3,"AARON, KIMBERLEI R",Chief Contract Expediter,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",Civil Engineer Iv,WATER MANAGEMENT,$106836.00

In [51]:
water_workers = chicago["Position Title"].str.lower().str.contains("water")
chicago[water_workers]

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",Water Rate Taker,WATER MANAGEMENT,$90744.00
554,"ALUISE, VINCENT G",Foreman Of Water Pipe Construction,WATER MANAGEMENT,$102440.00
671,"ANDER, PERRY A",Water Chemist Ii,WATER MANAGEMENT,$82044.00
685,"ANDERSON, ANDREW J",District Superintendent Of Water Distribution,WATER MANAGEMENT,$109272.00
702,"ANDERSON, DONALD",Foreman Of Water Pipe Construction,WATER MANAGEMENT,$102440.00
...,...,...,...,...
29669,"VERMA, ANUPAM",Managing Engineer - Water Management,WATER MANAGEMENT,$111192.00
30239,"WASHINGTON, JOSEPH",Water Chemist Iii,WATER MANAGEMENT,$89676.00
30544,"WEST, THOMAS R",Gen Supt Of Water Management,WATER MANAGEMENT,$115704.00
30991,"WILLIAMS, MATTHEW",Foreman Of Water Pipe Construction,WATER MANAGEMENT,$102440.00
31405,"WOODRIDGE, ROBERT L",Foreman Of Water Pipe Construction,WATER MANAGEMENT,$102440.00

In [55]:
civil_workers = water_workers = chicago["Position Title"].str.lower().str.startswith("civil")
chicago.loc[civil_workers]

,Name,Position Title,Department,Employee Annual Salary
4,"ABAD JR, VICENTE M",Civil Engineer Iv,WATER MANAGEMENT,$106836.00
25,"ABDULSATTAR, MUDHAR",Civil Engineer Ii,WATER MANAGEMENT,$58536.00
34,"ABRAHAM, GIRLEY T",Civil Engineer Iv,WATER MANAGEMENT,$106836.00
55,"ABUTALEB, AHMAD H",Civil Engineer Ii,WATER MANAGEMENT,$89676.00
147,"ADAMS, TANERA C",Civil Engineer Iv,TRANSPORTN,$106836.00
...,...,...,...,...
31623,"YANG, LUYANG",Civil Engineer V,TRANSPORTN,$116784.00
31656,"YEPEZ, JESUS",Civil Engineer Iv,TRANSPORTN,$106836.00
31662,"YESUFU, STEPHANIE A",Civil Engineer Iii,TRANSPORTN,$92784.00
31797,"ZAKE, JOSHUA S",Civil Engineer Iv,TRANSPORTN,$106836.00
31935,"ZHANG, ANNE",Civil Engineer Iii,TRANSPORTN,$77364.00

In [59]:
rank_four = water_workers = chicago["Position Title"].str.lower().str.endswith("iv")
chicago.loc[rank_four]

,Name,Position Title,Department,Employee Annual Salary
4,"ABAD JR, VICENTE M",Civil Engineer Iv,WATER MANAGEMENT,$106836.00
34,"ABRAHAM, GIRLEY T",Civil Engineer Iv,WATER MANAGEMENT,$106836.00
145,"ADAMS, SHERYLL A",Librarian Iv,PUBLIC LIBRARY,$97812.00
147,"ADAMS, TANERA C",Civil Engineer Iv,TRANSPORTN,$106836.00
166,"ADENI, MOHAMED K",Accountant Iv,FINANCE,$97812.00
...,...,...,...,...
31777,"ZAFIRIS, CHRISTOPHER",Architect Iv,DISABILITIES,$106836.00
31797,"ZAKE, JOSHUA S",Civil Engineer Iv,TRANSPORTN,$106836.00
31870,"ZAVALA, FERNANDO",Accountant Iv,FINANCE,$97812.00
31884,"ZAWADSKI, JAMES",Clerk Iv,LAW,$68028.00
32008,"ZOTTA, SANDINO",Mechanical Engineer Iv,WATER MANAGEMENT,$106836.00

In [60]:
chicago = pd.read_csv("chicago.csv", index_col="Name").dropna(how="all")

In [61]:
chicago.head()

,Position Title,Department,Employee Annual Salary
Name,,,
"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [65]:
chicago.index = chicago.index.str.strip().str.title()

In [66]:
chicago.head()

,Position Title,Department,Employee Annual Salary
Name,,,
"Aaron, Elvia J",WATER RATE TAKER,WATER MGMNT,$90744.00
"Aaron, Jeffery M",POLICE OFFICER,POLICE,$84450.00
"Aaron, Karina",POLICE OFFICER,POLICE,$84450.00
"Aaron, Kimberlei R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
"Abad Jr, Vicente M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [67]:
chicago.columns

Index(['Position Title', 'Department', 'Employee Annual Salary'], dtype='object')

In [69]:
chicago.columns = chicago.columns.str.upper()

In [70]:
chicago.head()

,POSITION TITLE,DEPARTMENT,EMPLOYEE ANNUAL SALARY
Name,,,
"Aaron, Elvia J",WATER RATE TAKER,WATER MGMNT,$90744.00
"Aaron, Jeffery M",POLICE OFFICER,POLICE,$84450.00
"Aaron, Karina",POLICE OFFICER,POLICE,$84450.00
"Aaron, Kimberlei R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
"Abad Jr, Vicente M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [71]:
"Water Rate Taker".split(" ")

['Water', 'Rate', 'Taker']

In [80]:
# most common first word in our job positions
chicago["POSITION TITLE"].str.split(" ").str.get(0).value_counts().head()

POLICE             10856
FIREFIGHTER-EMT     1509
SERGEANT            1186
POOL                 918
FIREFIGHTER          810
Name: POSITION TITLE, dtype: int64

In [83]:
# most common first name among employees

chicago = pd.read_csv("chicago.csv").dropna(how="all")
chicago["Name"]

0            AARON,  ELVIA J
1          AARON,  JEFFERY M
2             AARON,  KARINA
3        AARON,  KIMBERLEI R
4        ABAD JR,  VICENTE M
                ...
32057    ZYGADLO,  MICHAEL J
32058     ZYGOWICZ,  PETER J
32059      ZYMANTAS,  MARK E
32060    ZYRKOWSKI,  CARLO E
32061    ZYSKOWSKI,  DARIUSZ
Name: Name, Length: 32062, dtype: object

In [90]:
chicago["Name"].str.title().str.split(", ").str.get(1).iloc[0]

' Elvia J'

In [91]:
chicago["Name"].str.title().str.split(", ").str.get(1).str.strip()

0            Elvia J
1          Jeffery M
2             Karina
3        Kimberlei R
4          Vicente M
            ...
32057      Michael J
32058        Peter J
32059         Mark E
32060        Carlo E
32061        Dariusz
Name: Name, Length: 32062, dtype: object

In [99]:
chicago["First Name"] = chicago["Name"].str.title().str.split(", ").str.get(1).str.strip().str.split(" ").str.get(0)

In [100]:
chicago.head()

,Name,Position Title,Department,Employee Annual Salary,First Name
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00,Elvia
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00,Jeffery
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00,Karina
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00,Kimberlei
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00,Vicente

In [102]:
chicago["First Name"].value_counts().head()

Michael    1153
John        899
James       676
Robert      622
Joseph      537
Name: First Name, dtype: int64

In [107]:
chicago["Last Name"] = chicago["Name"].str.title().str.split(", ").str.get(0).str.strip()

In [108]:
chicago["Last Name"].value_counts().head()

Williams    293
Johnson     244
Smith       241
Brown       185
Jones       183
Name: Last Name, dtype: int64

In [109]:
chicago["Last Name"].value_counts().tail()

Horkavy      1
Horn         1
Horne Jr     1
Horner       1
Zyskowski    1
Name: Last Name, dtype: int64

In [111]:
chicago = pd.read_csv("chicago.csv").dropna(how="all")
chicago.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [118]:
chicago[["Last Name", "First and Middle"]] = chicago["Name"].str.title().str.split(",", expand = True)

In [119]:
chicago.head()

,Name,Position Title,Department,Employee Annual Salary,Last Name,First and Middle
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00,Aaron,Elvia J
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00,Aaron,Jeffery M
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00,Aaron,Karina
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00,Aaron,Kimberlei R
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00,Abad Jr,Vicente M

In [125]:
chicago[["Primary Title", "Secondary Title"]] =chicago["Position Title"].str.split(" ", expand=True, n=1)
chicago.head()

,Name,Position Title,Department,Employee Annual Salary,Last Name,First and Middle,Primary Title,Secondary Title
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00,Aaron,Elvia J,WATER,RATE TAKER
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00,Aaron,Jeffery M,POLICE,OFFICER
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00,Aaron,Karina,POLICE,OFFICER
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00,Aaron,Kimberlei R,CHIEF,CONTRACT EXPEDITER
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00,Abad Jr,Vicente M,CIVIL,ENGINEER IV

In [126]:
chicago["Primary Title"].value_counts()

POLICE             10856
FIREFIGHTER-EMT     1509
SERGEANT            1186
POOL                 918
FIREFIGHTER          810
                   ...
DENTIST                1
ASSOC                  1
TELEPHONE              1
MAYOR                  1
PREPRESS               1
Name: Primary Title, Length: 320, dtype: int64